import { randomNumber } from './randomNumber.ts'

export const divination = () => {
    const results = ['ты умрёш', 'тебе осталось жить 5 дней', 'всё будет хорошо', 'ты победишь', 'соболезную', 'удачи',
        "лучше попробуй ещё раз", "не отчаивайтесь, если результат гадания неблагоприятный", "иди погуляй", "у тебя будет хороший день",
        "ты со всем справишься", "сейчас самое время отдохнуть", "колдую тебе хорошее настроение", "мяу"]
    
    return results[randomNumber(0, results.length)]
}